# Pandas
### Python Pandas: Tips & Tricks

### #4: Pemilihan kolom (Columns selection) pada pandas DataFrame berdasarkan tipe data

### Importing Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.2
2.0.1

### Persiapan Data Frame

In [4]:
n_rows = 5
n_cols = 2
cols = ['bil_pecahan', 'bil_bulat']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), columns=cols)
df['bil_pecahan'] = df['bil_pecahan'].astype('float')

df.index = pd.date_range(start='2024-10-16', periods=n_rows, freq='h')
df = df.reset_index()

df['teks'] = list('ABCDE')

df

                index  bil_pecahan  bil_bulat teks
0 2024-10-16 00:00:00          6.0          1    A
1 2024-10-16 01:00:00         12.0         14    B
2 2024-10-16 02:00:00         12.0          6    C
3 2024-10-16 03:00:00          6.0          2    D
4 2024-10-16 04:00:00          6.0          5    E

In [5]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int64
teks                   object
dtype: object

### Memilih kolom bertipe data numerik

In [6]:
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0          6.0          1
1         12.0         14
2         12.0          6
3          6.0          2
4          6.0          5

In [7]:
df.select_dtypes(include='float')

   bil_pecahan
0          6.0
1         12.0
2         12.0
3          6.0
4          6.0

In [8]:
df.select_dtypes(include='int')

   bil_bulat
0          1
1         14
2          6
3          2
4          5

### Memilih kolom bertipe data string atau object

In [9]:
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

### memilih kolom bertipe data datetime

In [10]:
df.select_dtypes(include='datetime')

                index
0 2024-10-16 00:00:00
1 2024-10-16 01:00:00
2 2024-10-16 02:00:00
3 2024-10-16 03:00:00
4 2024-10-16 04:00:00

### Memilih kolom dengan kombinasi tipe data

In [11]:
df.select_dtypes(include=['number', 'object'])

   bil_pecahan  bil_bulat teks
0          6.0          1    A
1         12.0         14    B
2         12.0          6    C
3          6.0          2    D
4          6.0          5    E